STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_spi.c
/**
  **********************************************************************************************************************
  * @file    stm32_adv_lpbam_spi.c
  * @author  MCD Application Team
  * @brief   This file provides the advanced LPBAM layer for SPI peripheral.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  @verbatim
  ======================================================================================================================
                                 ############### How to use this driver ###############
  ======================================================================================================================
    [..]
      It is strongly recommended to read carefully the LPBAM_Utility_GettingStarted.html document before starting
      developing an LPBAM application.

    *** Driver description ***
    ==========================
    [..]
      This advanced LPBAM module counts 3 files :
          (+) stm32_adv_lpbam_spi.c
              (++) This file provides the SPI advanced files body.
          (+) stm32_adv_lpbam_spi.h
              (++) This file is the header file of stm32_adv_lpbam_spi.c. It provides advanced used types.
          (+) stm32_platform_lpbam_spi.h
              (++) This header file contains all defines to be used in applicative side.

    *** Driver features ***
    =======================
    [..]
      This driver provides the following list of features :
          (+) Configure the SPI transfers in simplex and full duplex.
          (+) Starts the SPI data transfers in simplex and full duplex.
          (+) Configure and starts the SPI data transfers in simplex and full duplex.

    *** Functional description ***
    ==============================
    [..]
      The SPI peripheral transfer is configured through a DMA channel thanks to a build DMA linked-list queue in simplex
      and full duplex mode.
      The SPI peripheral transfer is started through a DMA channel thanks to a build DMA linked-list queue in simplex
      and full duplex mode.
      The SPI peripheral transfer is configured and started through a DMA channel thanks to a build DMA linked-list
      queue in simplex and full duplex mode.

      The output of this driver can be only one queue to be executed by one DMA channel for simplex operations and can
      be two queues to be executed by two DMA channel for full duplex operations.

    *** Driver APIs description ***
    ===============================
    [..]
      Use ADV_LPBAM_SPI_Tx_SetConfigQ() API to build a linked-list queue that setup the SPI simplex configuration
      transmission operation according to parameters in the LPBAM_SPI_ConfigAdvConf_t structure.

    [..]
      Use ADV_LPBAM_SPI_Tx_SetDataQ() API to build a linked-list queue that setup the SPI simplex transmission
      starting operation according to parameters in the LPBAM_SPI_DataAdvConf_t structure.
      The data node default configuration is as follow:
          (+) SrcInc            : DMA_SINC_INCREMENTED.
          (+) DestInc           : DMA_DINC_FIXED. (Mandatory)
          (+) SrcDataWidth      : DMA_SRC_DATAWIDTH_BYTE or DMA_SRC_DATAWIDTH_HALFWORD according to programmed DataSize
                                  value.
          (+) DestDataWidth     : DMA_DEST_DATAWIDTH_BYTE or DMA_DEST_DATAWIDTH_HALFWORD according to programmed
                                  DataSize value. (Mandatory)
          (+) TransferEventMode : DMA_TCEM_LAST_LL_ITEM_TRANSFER.
          (+) SrcSecure         : DMA_CHANNEL_SRC_SEC. (For trust zone devices)
          (+) DestSecure        : DMA_CHANNEL_DEST_SEC. (For trust zone devices)

    [..]
      Use ADV_LPBAM_SPI_Tx_SetFullQ() API to build a linked-list queue that setup the SPI simplex configuration and
      transmission starting operation according to parameters in the LPBAM_SPI_FullAdvConf_t structure.
      The data node default configuration is as follow:
          (+) SrcInc            : DMA_SINC_INCREMENTED.
          (+) DestInc           : DMA_DINC_FIXED. (Mandatory)
          (+) SrcDataWidth      : DMA_SRC_DATAWIDTH_BYTE or DMA_SRC_DATAWIDTH_HALFWORD according to programmed DataSize
                                  value.
          (+) DestDataWidth     : DMA_DEST_DATAWIDTH_BYTE or DMA_DEST_DATAWIDTH_HALFWORD according to programmed
                                  DataSize value. (Mandatory)
          (+) TransferEventMode : DMA_TCEM_LAST_LL_ITEM_TRANSFER.
          (+) SrcSecure         : DMA_CHANNEL_SRC_SEC. (For trust zone devices)
          (+) DestSecure        : DMA_CHANNEL_DEST_SEC. (For trust zone devices)

    [..]
      Use ADV_LPBAM_SPI_Rx_SetConfigQ() API to build a linked-list queue that setup the SPI simplex configuration
      reception operation according to parameters in the LPBAM_SPI_ConfigAdvConf_t structure.

    [..]
      Use ADV_LPBAM_SPI_Rx_SetDataQ() API to build a linked-list queue that setup the SPI simplex reception starting
      operation according to parameters in the LPBAM_SPI_DataAdvConf_t structure.
      The data node default configuration is as follow:
          (+) SrcInc            : DMA_SINC_FIXED. (Mandatory)
          (+) DestInc           : DMA_DINC_INCREMENTED.
          (+) SrcDataWidth      : DMA_SRC_DATAWIDTH_BYTE or DMA_SRC_DATAWIDTH_HALFWORD according to programmed DataSize
                                  value. (Mandatory)
          (+) DestDataWidth     : DMA_DEST_DATAWIDTH_BYTE or DMA_DEST_DATAWIDTH_HALFWORD according to programmed
                                  DataSize value.
          (+) TransferEventMode : DMA_TCEM_LAST_LL_ITEM_TRANSFER.
          (+) SrcSecure         : DMA_CHANNEL_SRC_SEC. (For trust zone devices)
          (+) DestSecure        : DMA_CHANNEL_DEST_SEC. (For trust zone devices)

