STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_spi.c
    [..]
      Use ADV_LPBAM_SPI_Rx_SetFullQ() API to build a linked-list queue that setup the SPI simplex configuration and
      reception starting operation according to parameters in the LPBAM_SPI_FullAdvConf_t structure.
      The data node default configuration is as follow:
          (+) SrcInc            : DMA_SINC_FIXED. (Mandatory)
          (+) DestInc           : DMA_DINC_INCREMENTED.
          (+) SrcDataWidth      : DMA_SRC_DATAWIDTH_BYTE or DMA_SRC_DATAWIDTH_HALFWORD according to programmed DataSize
                                  value. (Mandatory)
          (+) DestDataWidth     : DMA_DEST_DATAWIDTH_BYTE or DMA_DEST_DATAWIDTH_HALFWORD according to programmed
                                  DataSize value.
          (+) TransferEventMode : DMA_TCEM_LAST_LL_ITEM_TRANSFER.
          (+) SrcSecure         : DMA_CHANNEL_SRC_SEC. (For trust zone devices)
          (+) DestSecure        : DMA_CHANNEL_DEST_SEC. (For trust zone devices)

    [..]
      Use ADV_LPBAM_SPI_TxRx_SetConfigQ() API to build a linked-list queue that setup the SPI full duplex configuration
      transmission and reception operation according to parameters in the LPBAM_SPI_ConfigAdvConf_t structure.
      The output of this API is one queue that must be executed by the DMA transmit channel.

    [..]
      Use ADV_LPBAM_SPI_TxRx_SetDataQ() API to build a linked-list queue that setup the SPI full duplex
      transmission and reception starting operation according to parameters in the LPBAM_SPI_DataAdvConf_t structure.
      The output of this API is two queues that must be executed by two different DMA channel.
      The transmit data node default configuration is as follow:
          (+) SrcInc            : DMA_SINC_INCREMENTED.
          (+) DestInc           : DMA_DINC_FIXED. (Mandatory)
          (+) SrcDataWidth      : DMA_SRC_DATAWIDTH_BYTE or DMA_SRC_DATAWIDTH_HALFWORD according to programmed DataSize
                                  value.
          (+) DestDataWidth     : DMA_DEST_DATAWIDTH_BYTE or DMA_DEST_DATAWIDTH_HALFWORD according to programmed
                                  DataSize value. (Mandatory)
          (+) TransferEventMode : DMA_TCEM_LAST_LL_ITEM_TRANSFER.
          (+) SrcSecure         : DMA_CHANNEL_SRC_SEC. (For trust zone devices)
          (+) DestSecure        : DMA_CHANNEL_DEST_SEC. (For trust zone devices)
      The receive data node default configuration is as follow:
          (+) SrcInc            : DMA_SINC_FIXED. (Mandatory)
          (+) DestInc           : DMA_DINC_INCREMENTED.
          (+) SrcDataWidth      : DMA_SRC_DATAWIDTH_BYTE or DMA_SRC_DATAWIDTH_HALFWORD according to programmed DataSize
                                  value. (Mandatory)
          (+) DestDataWidth     : DMA_DEST_DATAWIDTH_BYTE or DMA_DEST_DATAWIDTH_HALFWORD according to programmed
                                  DataSize value.
          (+) TransferEventMode : DMA_TCEM_LAST_LL_ITEM_TRANSFER.
          (+) SrcSecure         : DMA_CHANNEL_SRC_SEC. (For trust zone devices)
          (+) DestSecure        : DMA_CHANNEL_DEST_SEC. (For trust zone devices)

    [..]
      Use ADV_LPBAM_SPI_TxRx_SetFullQ() API to build a linked-list queue that setup the SPI full duplex configuration,
      transmission and reception starting operation according to parameters in the LPBAM_SPI_FullAdvConf_t structure.
      The output of this API is two queues that must be executed by two different DMA channel.
      The transmit data node default configuration is as follow:
          (+) SrcInc            : DMA_SINC_INCREMENTED.
          (+) DestInc           : DMA_DINC_FIXED. (Mandatory)
          (+) SrcDataWidth      : DMA_SRC_DATAWIDTH_BYTE or DMA_SRC_DATAWIDTH_HALFWORD according to programmed DataSize
                                  value.
          (+) DestDataWidth     : DMA_DEST_DATAWIDTH_BYTE or DMA_DEST_DATAWIDTH_HALFWORD according to programmed
                                  DataSize value. (Mandatory)
          (+) TransferEventMode : DMA_TCEM_LAST_LL_ITEM_TRANSFER.
          (+) SrcSecure         : DMA_CHANNEL_SRC_SEC. (For trust zone devices)
          (+) DestSecure        : DMA_CHANNEL_DEST_SEC. (For trust zone devices)
      The receive data node default configuration is as follow:
          (+) SrcInc            : DMA_SINC_FIXED. (Mandatory)
          (+) DestInc           : DMA_DINC_INCREMENTED.
          (+) SrcDataWidth      : DMA_SRC_DATAWIDTH_BYTE or DMA_SRC_DATAWIDTH_HALFWORD according to programmed DataSize
                                  value. (Mandatory)
          (+) DestDataWidth     : DMA_DEST_DATAWIDTH_BYTE or DMA_DEST_DATAWIDTH_HALFWORD according to programmed
                                  DataSize value.
          (+) TransferEventMode : DMA_TCEM_LAST_LL_ITEM_TRANSFER.
          (+) SrcSecure         : DMA_CHANNEL_SRC_SEC. (For trust zone devices)
          (+) DestSecure        : DMA_CHANNEL_DEST_SEC. (For trust zone devices)

    [..]
      Configuration parameters through LPBAM_SPI_ConfigAdvConf_t are :
          (+) CLKPolarity       : Specifies the serial clock steady state.
                                  This parameter can be a value of @ref SPI_Clock_Polarity.
          (+) CLKPhase          : Specifies the clock active edge for the bit capture.
                                  This parameter can be a value of @ref SPI_Clock_Phase.
          (+) FirstBit          : Specifies whether data transfers start from MSB or LSB bit.
                                  This parameter can be a value of @ref LPBAM_SPI_FirstBit.
          (+) BaudRatePrescaler : Specifies the Baud Rate prescaler value which will be used to configure the transmit
                                  and receive SCK clock.
                                  This parameter can be a value of @ref LPBAM_SPI_BaudRate.
          (+) DataSize          : Specifies the SPI data size.
                                  This parameter can be a value of @ref LPBAM_SPI_Data_Size.
          (+) AutoModeConf      : Specifies the autonomous mode configuration.
              (++) TriggerState     : Specifies the trigger state.
                                      This parameter can be a value of @ref LPBAM_SPI_AutonomousMode_State.
              (++) TriggerSelection : Specifies the autonomous mode trigger signal selection.
                                      This parameter can be a value of @ref LPBAM_SPI_AutonomousMode_TriggerSelection.
              (++) TriggerPolarity  : Specifies the autonomous mode trigger signal polarity sensitivity.
                                      This parameter can be a value of @ref LPBAM_SPI_AutonomousMode_TriggerPolarity
          (+) WakeupIT          : Specifies the wake up source interrupt.
                                  This parameter can be a value of @ref LPBAM_SPI_Wakeup_Interrupt.

      Configuration parameters through LPBAM_SPI_DataAdvConf_t are :
          (+) AutoModeConf      : Specifies the autonomous mode configuration.
              (++) TriggerState     : Specifies the trigger state.
                                      This parameter can be a value of @ref LPBAM_SPI_TriggerState.
          (+) DataSize          : Specifies the SPI data size.
                                  This parameter can be a value of @ref LPBAM_SPI_Data_Size.
          (+) Size              : Specifies the element number.
          (+) pTxData           : Specifies the Tx transfer data buffer address (Used only for simplex transmission
                                  and full duplex operations.
          (+) pRxData           : Specifies the Rx transfer data buffer address (Used only for simplex reception
                                  and full duplex operations.

      Configuration parameters through LPBAM_SPI_FullAdvConf_t are :
          (+) CLKPolarity       : Specifies the serial clock steady state.
                                  This parameter can be a value of @ref SPI_Clock_Polarity.
          (+) CLKPhase          : Specifies the clock active edge for the bit capture.
                                  This parameter can be a value of @ref SPI_Clock_Phase.
          (+) FirstBit          : Specifies whether data transfers start from MSB or LSB bit.
                                  This parameter can be a value of @ref LPBAM_SPI_FirstBit
          (+) BaudRatePrescaler : Specifies the Baud Rate prescaler value which will be used to configure the transmit
                                  and receive SCK clock.
                                  This parameter can be a value of @ref LPBAM_SPI_BaudRate_Prescaler.
          (+) DataSize          : Specifies the SPI data size.
                                  This parameter can be a value of @ref LPBAM_SPI_Data_Size.
          (+) AutoModeConf      : Specifies the autonomous mode configuration.
              (++) TriggerState     : Specifies the trigger state.
                                      This parameter can be a value of @ref LPBAM_SPI_AutonomousMode_State.
              (++) TriggerSelection : Specifies the autonomous mode trigger signal selection.
                                      This parameter can be a value of @ref LPBAM_SPI_AutonomousMode_TriggerSelection.
              (++) TriggerPolarity  : Specifies the autonomous mode trigger signal polarity sensitivity.
                                      This parameter can be a value of @ref LPBAM_SPI_AutonomousMode_TriggerPolarity
          (+) WakeupIT          : Specifies the wake up source interrupt.
                                  This parameter can be a value of @ref LPBAM_SPI_Wakeup_Interrupt.
          (+) Size              : Specifies the element number.
          (+) pTxData           : Specifies the Tx transfer data buffer address (Used only for simplex transmission
                                  and full duplex operations.
          (+) pRxData           : Specifies the Rx transfer data buffer address (Used only for simplex reception
                                  and full duplex operations.

