STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_spi.c
    [..]
      These APIs must be called when the SPI is well initialized.
          (+) Recommended SPI initialization sequence
              (++) call HAL_SPI_Init to initialize the SPI. (Mandatory)
                   Initialization parameters can be :
                   (+++) Mode                  : SPI_MODE_MASTER.
                   (+++) Direction             : SPI_DIRECTION_2LINES.
                   (+++) DataSize              : SPI_DATASIZE_8BIT.
                   (+++) CLKPolarity           : SPI_POLARITY_LOW.
                   (+++) CLKPhase              : SPI_PHASE_1EDGE.
                   (+++) NSS                   : SPI_NSS_SOFT.
                   (+++) BaudRatePrescaler     : SPI_BAUDRATEPRESCALER_256.
                   (+++) FirstBit              : SPI_FIRSTBIT_MSB.
                   (+++) TIMode                : SPI_TIMODE_DISABLE.
                   (+++) CRCCalculation        : SPI_CRCCALCULATION_DISABLE.
                   (+++) NSSPMode              : SPI_NSS_PULSE_DISABLE.
                   (+++) MasterKeepIOState     : SPI_MASTER_KEEP_IO_STATE_ENABLE.
                   (+++) ReadyMasterManagement : SPI_RDY_MASTER_MANAGEMENT_INTERNALLY.
              (++) call HAL_SPIEx_SetConfigAutonomousMode to configure the autonomous mode. (Mandatory)
                   (+++) TriggerState     : Any.
                   (+++) TriggerSelection : Any.
                   (+++) TriggerPolarity  : Any.
              (++) Call __HAL_SPI_ENABLE_IT() to enable error interrupts.
                   SPI error interrupts can be :
                   (+++) SPI_IT_UDR  : underrun error.
                   (+++) SPI_IT_OVR  : overrun error.
          (+) Call ADV_LPBAM_SPI_EnableDMARequests() to enable SPI DMA requests. (Mandatory in case
                                                                                  ADV_LPBAM_SPI_{Operation}_SetConfigQ()
                                                                                  will not be called)

    [..]
      The following parameters must be configured carefully as they are not configurable by LPBAM APIs :
          (+) Mode                  : This parameter can be a value of @ref SPI_Mode.
          (+) NSS                   : This parameter can be a value of @ref SPI_Slave_Select_Management.
          (+) TIMode                : This parameter should be this value SPI_TIMODE_DISABLE.
          (+) CRCCalculation        : This parameter should be this value SPI_CRCCALCULATION_DISABLE.
          (+) ReadyMasterManagement : This parameter should be this value SPI_RDY_MASTER_MANAGEMENT_INTERNALLY.

    *** Driver user sequence ***
    ============================
    [..]
      Generic user sequence is :
          (+) Initialize the SPI (Using HAL/LL). (Mandatory)
          (+) There are two possibilities to call advanced API:
              (++) Transfer with full API :
                   (+++) For a transmission mode repeat calling ADV_LPBAM_SPI_Tx_SetFullQ() until complete LPBAM
                         scenario. (Mandatory)
                   (+++) For a reception mode repeat calling ADV_LPBAM_SPI_Rx_SetFullQ() until complete LPBAM scenario.
                         (Mandatory)
                   (+++) For a full duplex mode repeat calling ADV_LPBAM_SPI_TxRx_SetFullQ() until complete LPBAM
                         scenario. (Mandatory)
              (++) Transfer with configuration and data APIs :
                   (+++) For a transmission mode call ADV_LPBAM_SPI_Tx_SetConfigQ only one time and repeat calling
                         ADV_LPBAM_SPI_Tx_SetDataQ() until complete LPBAM scenario. (Mandatory)
                   (+++) For a reception mode call ADV_LPBAM_SPI_Rx_SetConfigQ only one time and repeat calling
                         ADV_LPBAM_SPI_Rx_SetDataQ() until complete LPBAM scenario. (Mandatory)
                   (+++) For a full duplex mode call ADV_LPBAM_SPI_TxRx_SetConfigQ only one time and repeat calling
                         ADV_LPBAM_SPI_TxRx_SetDataQ() until complete LPBAM scenario. (Mandatory)
          (+) Call HAL_DMAEx_List_Init() to initialize the DMA in linked-list mode. (Mandatory)
          (+) Call HAL_DMAEx_List_LinkQ() to link the built queue to the DMA channel. (Mandatory)
          (+) Call __HAL_DMA_ENABLE_IT() to enable error interrupts.
              Any DMA error occurred in low power block the LPBAM sub-system mechanisms.
              DMA error interrupts can be :
              (++) DMA_IT_DTE : data transfer error.
              (++) DMA_IT_ULE : update link error.
              (++) DMA_IT_USE : user setting error.
          (+) Call HAL_DMAEx_List_Start() or HAL_DMAEx_List_Start_IT() to start DMA linked list. (Mandatory)

    [..]
      When the SPI configuration matches with application needs, it's strongly recommended to use
      ADV_LPBAM_SPI_{Operation}_SetDataQ() APIs instead of ADV_LPBAM_SPI_{Operation}_SetFullQ() for memory optimization
      purpose.
      Use ADV_LPBAM_SPI_{Operation}_SetFullQ() when SPI reconfiguration is needed instead of calling
      ADV_LPBAM_SPI_{Operation}_SetConfigQ() then ADV_LPBAM_SPI_{Operation}_SetDataQ() for memory optimization purpose.

    [..]
      When using ADV_LPBAM_SPI_TxRx_SetConfigQ() ensure that the Tx queue is passed as parameter.

    *** Recommendation ***
    ======================
    [..]
      It's mandatory to set properly DataSize, TriggerSelection and TriggerPolarity while configuring
      LPBAM_SPI_ConfigAdvConf_t or LPBAM_SPI_FullAdvConf_t because their update can be only done with
      ADV_LPBAM_SPI_{Operation}_SetConfigQ() or ADV_LPBAM_SPI_{Operation}_SetFullQ().

    [..]
      It's mandatory, while configuring LPBAM_SPI_DataAdvConf_t after calling ADV_LPBAM_SPI_{Operation}_SetConfigQ()
      or ADV_LPBAM_SPI_{Operation}_SetFullQ(), to attribute to DataSize the same value that it has already been set to
      it in LPBAM_SPI_ConfigAdvConf_t or LPBAM_SPI_FullAdvConf_t otherwise unexpected behavior can appear.

    [..]
      It's strongly not allowed to use the same DMA channel for transmission and reception when the SPI is
      used for different directions.

