STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_spi.c
    [..]
      It's strongly not recommended to execute the same linked-list queue that contains spi configuration and data
      nodes by two different DMA channels as unexpected behavior can appear.

    [..]
      It's mandatory to use only one linked-list queue when spi is used in simplex duplex mode.

    [..]
      It's mandatory to use two linked-list queues (One for the configuration and the transmission
      and another one for the reception) which will be executed simultaneously when spi is used in full duplex mode.

    [..]
      It's mandatory in full duplex mode to start the Rx linked-list queue before starting the Tx one.

    [..]
      It's mandatory to be sure that the slave is enabled and ready to the communication before the master starts
      generating its clock otherwise an unexpected behavior can appear.

    *** Driver status description ***
    =================================
    [..]
      This driver detects and reports any detected issue.
          (+) returned values are :
              (++) LPBAM_OK when no error is detected.
              (++) LPBAM_ERROR when error is detected.
              (++) LPBAM_INVALID_ID when an invalid node ID is detected. This error value is specific for LPBAM basic
                   layer.

    @endverbatim
  **********************************************************************************************************************
  */

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32_lpbam.h"

#ifdef LPBAM_SPI_MODULE_ENABLED

/* Private typedef ---------------------------------------------------------------------------------------------------*/
/* Private define ----------------------------------------------------------------------------------------------------*/
/* Private variables -------------------------------------------------------------------------------------------------*/
/* Private macro -----------------------------------------------------------------------------------------------------*/
/* Private function prototypes ---------------------------------------------------------------------------------------*/
/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @addtogroup LPBAM_Utilities_Driver
  * @{
  */

/** @defgroup SPI_Advanced SPI_Advanced
  * @brief    SPI Advanced LPBAM module driver
  * @{
  */

/** @defgroup LPBAM_SPI_Advanced_Exported_Functions LPBAM SPI Advanced Exported Functions
  * @{
  */

/**
  * @brief  Build the SPI transmit configuration nodes in DMA linked-list queue according to configured parameters in
  *         LPBAM_SPI_ConfigAdvConf_t.
  * @param  pInstance    : [IN]  Pointer to a SPI_TypeDef structure that selects SPI instance.
  * @param  pDMAListInfo : [IN]  Pointer to a LPBAM_DMAListInfo_t structure that contains DMA instance and linked-list
  *                              queue type information.
  * @param  pTxConfig    : [IN]  Pointer to a LPBAM_SPI_ConfigAdvConf_t structure that contains transmit configuration
  *                              nodes information.
  * @param  pDescriptor  : [IN]  Pointer to a LPBAM_SPI_ConfigTxDesc_t structure that contains transmit configuration
  *                              descriptor information.
  * @param  pQueue       : [OUT] Pointer to a DMA_QListTypeDef structure that contains DMA linked-list queue
  *                              information.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t ADV_LPBAM_SPI_Tx_SetConfigQ(SPI_TypeDef               *const pInstance,
                                           LPBAM_DMAListInfo_t       const *const pDMAListInfo,
                                           LPBAM_SPI_ConfigAdvConf_t const *const pTxConfig,
                                           LPBAM_SPI_TxConfigDesc_t  *const pDescriptor,
                                           DMA_QListTypeDef          *const pQueue)
{
  LPBAM_SPI_ConfNode_t config_node;
  DMA_NodeConfTypeDef  dma_node_config;

  uint32_t node_idx = 0U;
  uint32_t reg_idx  = 0U;

  /*
   *               ######## SPI disable node ########
   */

  /* Set SPI instance */
  config_node.pInstance                  = pInstance;

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID   = (uint32_t)LPBAM_SPI_STATE_ID;
  config_node.NodeDesc.NodeInfo.NodeType = pDMAListInfo->QueueType;
  config_node.NodeDesc.pSrcVarReg        = &pDescriptor->pReg[reg_idx];

  /* Set specific parameters for node creation */
  config_node.Config.State               = DISABLE;

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_SPI_FillNodeConfig(&config_node, &dma_node_config) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build configuration state node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_config, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert configuration state node to SPI queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


  /*
   *               ######## SPI clear flag node ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_SPI_CLEARFLAG_ID;
  config_node.NodeDesc.pSrcVarReg      = &pDescriptor->pReg[reg_idx];

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_SPI_FillNodeConfig(&config_node, &dma_node_config) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build clear flag node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_config, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert clear flag node to SPI queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


