STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_spi.c
  /*
   *               ######## SPI frame configuration node ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID  = (uint32_t)LPBAM_SPI_CONFIG_FRAME_ID;
  config_node.NodeDesc.pSrcVarReg       = &pDescriptor->pReg[reg_idx];

  /* Set specific parameters for node creation */
  config_node.Config.BaudRatePrescaler  = pTxConfig->BaudRatePrescaler;
  config_node.Config.DataSize           = pTxConfig->DataSize;
  config_node.Config.Direction          = LPBAM_SPI_DIRECTION_2LINES_TXONLY;

  /* Fill node configuration */
  if (LPBAM_SPI_FillNodeConfig(&config_node, &dma_node_config) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build frame configuration node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_config, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert frame configuration node to SPI queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


  /*
   *               ######## SPI configure communication node ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_SPI_CONFIG_COM_ID;
  config_node.NodeDesc.pSrcVarReg      = &pDescriptor->pReg[reg_idx];

  /* Set specific parameters for node creation */
  config_node.Config.CLKPolarity       = pTxConfig->CLKPolarity;
  config_node.Config.CLKPhase          = pTxConfig->CLKPhase;
  config_node.Config.FirstBit          = pTxConfig->FirstBit;

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_SPI_FillNodeConfig(&config_node, &dma_node_config) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build configure Communication node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_config, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert configure Communication node to SPI queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


  /*
   *               ######## SPI autonomous mode node ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID             = (uint32_t)LPBAM_SPI_TRIG_ID;
  config_node.NodeDesc.pSrcVarReg                  = &pDescriptor->pReg[reg_idx];

  /* Set specific parameters for node creation */
  config_node.Config.AutoModeConf.TriggerState     = pTxConfig->AutoModeConf.TriggerState;
  config_node.Config.AutoModeConf.TriggerSelection = pTxConfig->AutoModeConf.TriggerSelection;
  config_node.Config.AutoModeConf.TriggerPolarity  = pTxConfig->AutoModeConf.TriggerPolarity;

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_SPI_FillNodeConfig(&config_node, &dma_node_config) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build autonomous mode node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_config, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert autonomous mode node to SPI queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


  /*
   *               ######## SPI wake up interrupt node ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_SPI_WAKEUP_IT_ID;
  config_node.NodeDesc.pSrcVarReg      = &pDescriptor->pReg[reg_idx];

  /* Set specific parameters for node creation */
  config_node.Config.WakeupIT          = pTxConfig->WakeupIT;

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_SPI_FillNodeConfig(&config_node, &dma_node_config) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build interrupt state node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_config, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert interrupt state node to SPI queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


  /*
   *               ######## SPI enable node ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_SPI_STATE_ID;
  config_node.NodeDesc.pSrcVarReg      = &pDescriptor->pReg[reg_idx];

  /* Set specific parameters for node creation */
  config_node.Config.State             = ENABLE;

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_SPI_FillNodeConfig(&config_node, &dma_node_config) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build enable instance node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_config, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert enable instance node to SPI queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  return LPBAM_OK;
}

/**
  * @brief  Build the SPI transmit data nodes in DMA linked-list queue according to configured parameters in
  *         LPBAM_SPI_DataAdvConf_t.
  * @param  pInstance    : [IN]  Pointer to a SPI_TypeDef structure that selects SPI instance.
  * @param  pDMAListInfo : [IN]  Pointer to a LPBAM_DMAListInfo_t structure that contains DMA instance and linked-list
  *                              queue type information.
  * @param  pTxData      : [IN]  Pointer to a LPBAM_SPI_DataAdvConf_t structure that contains transmit data nodes
  *                              information.
  * @param  pDescriptor  : [IN]  Pointer to a LPBAM_SPI_DataTxDesc_t structure that contains transmit data descriptor
  *                              information.
  * @param  pQueue       : [OUT] Pointer to a DMA_QListTypeDef structure that contains DMA linked-list queue
  *                              information.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t ADV_LPBAM_SPI_Tx_SetDataQ(SPI_TypeDef             *const pInstance,
                                         LPBAM_DMAListInfo_t     const *const pDMAListInfo,
                                         LPBAM_SPI_DataAdvConf_t const *const pTxData,
                                         LPBAM_SPI_TxDataDesc_t  *const pDescriptor,
                                         DMA_QListTypeDef        *const pQueue)
{
  LPBAM_SPI_ConfNode_t config_node;
  DMA_NodeConfTypeDef  dma_node_config;

