STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_spi.c
  uint32_t buffer_address;
  uint32_t node_idx = 0U;
  uint32_t reg_idx  = 0U;

  /*
   *               ######## SPI disable node ########
   */

  /* Set SPI instance */
  config_node.pInstance                  = pInstance;

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID   = (uint32_t)LPBAM_SPI_STATE_ID;
  config_node.NodeDesc.NodeInfo.NodeType = pDMAListInfo->QueueType;
  config_node.NodeDesc.pSrcVarReg        = &pTxDescriptor->pTxReg[reg_idx];

  /* Set specific parameters for node creation */
  config_node.Config.State               = DISABLE;

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_SPI_FillNodeConfig(&config_node, &dma_node_config) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build configuration state node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_config, &pTxDescriptor->pTxNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert configuration state node to SPI Tx queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pTxQueue, &pTxDescriptor->pTxNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


  /*
   *               ######## SPI clear flag node ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_SPI_CLEARFLAG_ID;
  config_node.NodeDesc.pSrcVarReg      = &pTxDescriptor->pTxReg[reg_idx];

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_SPI_FillNodeConfig(&config_node, &dma_node_config) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build clear flag node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_config, &pTxDescriptor->pTxNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert clear flag node to SPI Tx queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pTxQueue, &pTxDescriptor->pTxNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


  /*
   *               ######## SPI set date size node ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_SPI_DATASIZE_ID;
  config_node.NodeDesc.pSrcVarReg      = &pTxDescriptor->pTxReg[reg_idx];

  /* Set specific parameters for node creation */
  config_node.Config.Size              = pTxRxData->Size;

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_SPI_FillNodeConfig(&config_node, &dma_node_config) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build set date size node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_config, &pTxDescriptor->pTxNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert set date size node to SPI Tx queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pTxQueue, &pTxDescriptor->pTxNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


  /*
   *               ######## SPI enable node ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_SPI_STATE_ID;
  config_node.NodeDesc.pSrcVarReg      = &pTxDescriptor->pTxReg[reg_idx];

  /* Set specific parameters for node creation */
  config_node.Config.State             = ENABLE;

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_SPI_FillNodeConfig(&config_node, &dma_node_config) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build enable instance node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_config, &pTxDescriptor->pTxNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert enable instance node to SPI Tx queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pTxQueue, &pTxDescriptor->pTxNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


  /*
   *               ######## SPI start communication node ########
   */

  if (pTxRxData->AutoModeConf.TriggerState == LPBAM_SPI_AUTO_MODE_DISABLE)
  {
    /* Set node descriptor */
    config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_SPI_START_ID;
    config_node.NodeDesc.pSrcVarReg      = &pTxDescriptor->pTxReg[reg_idx];

    /* Fill descriptor for lpbam configuration transaction */
    if (LPBAM_SPI_FillNodeConfig(&config_node, &dma_node_config) != LPBAM_OK)
    {
      return LPBAM_ERROR;
    }

    /* Build start communication node */
    if (HAL_DMAEx_List_BuildNode(&dma_node_config, &pTxDescriptor->pTxNodes[node_idx]) != HAL_OK)
    {
      return LPBAM_ERROR;
    }

    /* Insert start communication node to SPI Tx queue */
    if (HAL_DMAEx_List_InsertNode_Tail(pTxQueue, &pTxDescriptor->pTxNodes[node_idx]) != HAL_OK)
    {
      return LPBAM_ERROR;
    }
  }

  /* Update node index */
  node_idx++;


  /*
   *               ######## SPI transmit data node ########
   */

  /* Get period buffer address */
  buffer_address                       = (uint32_t)pTxRxData->pTxData;

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_SPI_TRANSMIT_DATA_ID;
  config_node.NodeDesc.pBuff           = (uint32_t *)buffer_address;

  /* Set SPI configuration */
  config_node.Config.DataSize          = pTxRxData->DataSize;

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_SPI_FillNodeConfig(&config_node, &dma_node_config) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build transmit data node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_config, &pTxDescriptor->pTxNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert transmit data node to SPI queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pTxQueue, &pTxDescriptor->pTxNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }


  /*
   *               ######## SPI receive data node ########
   */

  /* Get period buffer address */
  buffer_address                       = (uint32_t)pTxRxData->pRxData;

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_SPI_RECEIVE_DATA_ID;
  config_node.NodeDesc.pBuff           = (uint32_t *)buffer_address;

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_SPI_FillNodeConfig(&config_node, &dma_node_config) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build receive data node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_config, &pRxDescriptor->pRxNodes[0]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

