STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_spi.c
  /* Insert receive data node to SPI queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pRxQueue, &pRxDescriptor->pRxNodes[0]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  return LPBAM_OK;
}

/**
  * @brief  Build the SPI transmit and receive full nodes in DMA linked-list queue according to configured parameters in
  *         LPBAM_SPI_FullAdvConf_t.
  * @param  pInstance    : [IN]  Pointer to a SPI_TypeDef structure that selects SPI instance.
  * @param  pDMAListInfo : [IN]  Pointer to a LPBAM_DMAListInfo_t structure that contains DMA instance and linked-list
  *                              queue type information.
  * @param  pTxRxFull    : [IN]  Pointer to a LPBAM_SPI_FullAdvConf_t structure that contains transmit and receive full
  *                              nodes information.
  * @param  pRxDescriptor: [IN]  Pointer to a LPBAM_SPI_TxRx_RxFullDesc_t structure that contains transmit and receive
  *                              data descriptor information.
  * @param  pTxDescriptor: [IN]  Pointer to a LPBAM_SPI_TxRx_TxFullDesc_t structure that contains transmit and receive
  *                              data descriptor information.
  * @param  pTxQueue     : [OUT] Pointer to a DMA_QListTypeDef structure that contains transmit full nodes DMA
  *                              linked-list queue information.
  * @param  pRxQueue     : [OUT] Pointer to a DMA_QListTypeDef structure that contains receive full nodes DMA
  *                              linked-list queue information.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t ADV_LPBAM_SPI_TxRx_SetFullQ(SPI_TypeDef                 *const pInstance,
                                           LPBAM_DMAListInfo_t         const *const pDMAListInfo,
                                           LPBAM_SPI_FullAdvConf_t     const *const pTxRxFull,
                                           LPBAM_SPI_TxRx_TxFullDesc_t *const pTxDescriptor,
                                           LPBAM_SPI_TxRx_RxFullDesc_t *const pRxDescriptor,
                                           DMA_QListTypeDef            *const pTxQueue,
                                           DMA_QListTypeDef            *const pRxQueue)
{
  LPBAM_SPI_ConfNode_t config_node;
  DMA_NodeConfTypeDef  dma_node_config;

  uint32_t buffer_address;
  uint32_t node_idx = 0U;
  uint32_t reg_idx  = 0U;

  /*
   *               ######## SPI disable node ########
   */

  /* Set SPI instance */
  config_node.pInstance                  = pInstance;

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID   = (uint32_t)LPBAM_SPI_STATE_ID;
  config_node.NodeDesc.NodeInfo.NodeType = pDMAListInfo->QueueType;
  config_node.NodeDesc.pSrcVarReg        = &pTxDescriptor->pTxReg[reg_idx];

  /* Set specific parameters for node creation */
  config_node.Config.State               = DISABLE;

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_SPI_FillNodeConfig(&config_node, &dma_node_config) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build configuration state node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_config, &pTxDescriptor->pTxNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert configuration state node to SPI queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pTxQueue, &pTxDescriptor->pTxNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


  /*
   *               ######## SPI clear flag node ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_SPI_CLEARFLAG_ID;
  config_node.NodeDesc.pSrcVarReg      = &pTxDescriptor->pTxReg[reg_idx];

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_SPI_FillNodeConfig(&config_node, &dma_node_config) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build clear flag node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_config, &pTxDescriptor->pTxNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert clear flag node to SPI queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pTxQueue, &pTxDescriptor->pTxNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


  /*
   *               ######## SPI set date size node ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_SPI_DATASIZE_ID;
  config_node.NodeDesc.pSrcVarReg      = &pTxDescriptor->pTxReg[reg_idx];

  /* Set specific parameters for node creation */
  config_node.Config.Size              = pTxRxFull->Size;

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_SPI_FillNodeConfig(&config_node, &dma_node_config) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build set date size node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_config, &pTxDescriptor->pTxNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert set date size node to SPI queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pTxQueue, &pTxDescriptor->pTxNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


  /*
   *               ######## SPI frame configuration node ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_SPI_CONFIG_FRAME_ID;
  config_node.NodeDesc.pSrcVarReg      = &pTxDescriptor->pTxReg[reg_idx];

  /* Set specific parameters for node creation */
  config_node.Config.BaudRatePrescaler = pTxRxFull->BaudRatePrescaler;
  config_node.Config.DataSize          = pTxRxFull->DataSize;
  config_node.Config.Direction         = LPBAM_SPI_DIRECTION_2LINES;

  /* Fill node configuration */
  if (LPBAM_SPI_FillNodeConfig(&config_node, &dma_node_config) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build frame configuration node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_config, &pTxDescriptor->pTxNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

