STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_spi.c
  /* Insert frame configuration node to SPI queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pTxQueue, &pTxDescriptor->pTxNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


  /*
   *               ######## SPI configure communication node ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_SPI_CONFIG_COM_ID;
  config_node.NodeDesc.pSrcVarReg      = &pTxDescriptor->pTxReg[reg_idx];

  /* Set specific parameters for node creation */
  config_node.Config.CLKPolarity       = pTxRxFull->CLKPolarity;
  config_node.Config.CLKPhase          = pTxRxFull->CLKPhase;
  config_node.Config.FirstBit          = pTxRxFull->FirstBit;

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_SPI_FillNodeConfig(&config_node, &dma_node_config) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build configure Communication node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_config, &pTxDescriptor->pTxNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert configure Communication node to SPI queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pTxQueue, &pTxDescriptor->pTxNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


  /*
   *               ######## SPI autonomous mode node ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID             = (uint32_t)LPBAM_SPI_TRIG_ID;
  config_node.NodeDesc.pSrcVarReg                  = &pTxDescriptor->pTxReg[reg_idx];

  /* Set specific parameters for node creation */
  config_node.Config.AutoModeConf.TriggerState     = pTxRxFull->AutoModeConf.TriggerState;
  config_node.Config.AutoModeConf.TriggerSelection = pTxRxFull->AutoModeConf.TriggerSelection;
  config_node.Config.AutoModeConf.TriggerPolarity  = pTxRxFull->AutoModeConf.TriggerPolarity;

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_SPI_FillNodeConfig(&config_node, &dma_node_config) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build autonomous mode node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_config, &pTxDescriptor->pTxNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert autonomous mode node to SPI queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pTxQueue, &pTxDescriptor->pTxNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


  /*
   *               ######## SPI wake up interrupt node ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_SPI_WAKEUP_IT_ID;
  config_node.NodeDesc.pSrcVarReg      = &pTxDescriptor->pTxReg[reg_idx];

  /* Set specific parameters for node creation */
  config_node.Config.WakeupIT          = pTxRxFull->WakeupIT;

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_SPI_FillNodeConfig(&config_node, &dma_node_config) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build interrupt state node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_config, &pTxDescriptor->pTxNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert interrupt state node to SPI queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pTxQueue, &pTxDescriptor->pTxNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


  /*
   *               ######## SPI enable node ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_SPI_STATE_ID;
  config_node.NodeDesc.pSrcVarReg      = &pTxDescriptor->pTxReg[reg_idx];

  /* Set specific parameters for node creation */
  config_node.Config.State             = ENABLE;

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_SPI_FillNodeConfig(&config_node, &dma_node_config) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build enable instance node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_config, &pTxDescriptor->pTxNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert enable instance node to SPI queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pTxQueue, &pTxDescriptor->pTxNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index and register index */
  node_idx++;
  reg_idx++;


  /*
   *               ######## SPI start communication node ########
   */

  if (config_node.Config.AutoModeConf.TriggerState == LPBAM_SPI_AUTO_MODE_DISABLE)
  {
    /* Set node descriptor */
    config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_SPI_START_ID;
    config_node.NodeDesc.pSrcVarReg      = &pTxDescriptor->pTxReg[reg_idx];

    /* Fill descriptor for lpbam configuration transaction */
    if (LPBAM_SPI_FillNodeConfig(&config_node, &dma_node_config) != LPBAM_OK)
    {
      return LPBAM_ERROR;
    }

    /* Build start communication node */
    if (HAL_DMAEx_List_BuildNode(&dma_node_config, &pTxDescriptor->pTxNodes[node_idx]) != HAL_OK)
    {
      return LPBAM_ERROR;
    }

    /* Insert start communication node to SPI Tx queue */
    if (HAL_DMAEx_List_InsertNode_Tail(pTxQueue, &pTxDescriptor->pTxNodes[node_idx]) != HAL_OK)
    {
      return LPBAM_ERROR;
    }
  }

  /* Update node index */
  node_idx++;


  /*
   *               ######## SPI transmit data node ########
   */

  /* Get period buffer address */
  buffer_address                       = (uint32_t)pTxRxFull->pTxData;

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_SPI_TRANSMIT_DATA_ID;
  config_node.NodeDesc.pBuff           = (uint32_t *)buffer_address;

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_SPI_FillNodeConfig(&config_node, &dma_node_config) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build transmit data node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_config, &pTxDescriptor->pTxNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert transmit data node to SPI queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pTxQueue, &pTxDescriptor->pTxNodes[node_idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }


  /*
   *               ######## SPI receive data node ########
   */

  /* Get period buffer address */
  buffer_address                       = (uint32_t)pTxRxFull->pRxData;

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_SPI_RECEIVE_DATA_ID;
  config_node.NodeDesc.pBuff           = (uint32_t *)buffer_address;

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_SPI_FillNodeConfig(&config_node, &dma_node_config) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build receive data node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_config, &pRxDescriptor->pRxNodes[0]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert receive data node to SPI queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pRxQueue, &pRxDescriptor->pRxNodes[0]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  return LPBAM_OK;
}

/**
  * @brief  Enable the SPI DMA requests.
  * @param  pInstance    : [IN]  Pointer to a SPI_TypeDef structure that selects SPI instance.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t ADV_LPBAM_SPI_EnableDMARequests(SPI_TypeDef *const pInstance)
{
  /* Enable SPI DMA requests */
  pInstance->CFG1 |= LPBAM_SPI_TXDMAEN | LPBAM_SPI_RXDMAEN;

  return LPBAM_OK;
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
#endif /* LPBAM_SPI_MODULE_ENABLED */
